export default {
  xAxis: {
    type: 'category',
    data: [
      '哺乳纲',
      '肠鳃纲',
      '腹足纲',
      '昆虫纲',
      '两栖纲',
      '鸟纲',
      '爬行纲',
      '软骨鱼纲',
      '软甲纲',
      '珊瑚纲',
      '双壳纲',
      '水螅纲',
      '头足纲',
      '文昌鱼纲',
      '硬骨鱼纲',
      '圆口纲',
      '肢口纲',
      '蛛形纲'
    ]
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      data: [185, 7, 5, 75, 93, 394, 94, 4, 1, 4, 15, 15, 1, 2, 83, 3, 2, 1],
      type: 'line'
    }
  ],
  grid: [
    {
      left: '10%',
      bottom: '30%',
      top: '5%',
      right: '1%'
    }
    // {
    //   left: '15%',
    //   bottom: '13%',
    //   top: '10%',
    //   right: '2%'
    // }
  ]
}
